# LIMPIEZA DE DATOS

In [83]:
import warnings
import sys
sys.path.append('../')
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

from scipy import stats

import warnings
warnings.filterwarnings('ignore')

In [84]:

from utils.funciones import data_report
from utils.funciones import verificador_unidades
from utils.funciones import apply_onehot_encoder

### LEEMOS EL ARCHIVO

In [85]:
ruta = '../data/raw/train.csv'
df = pd.read_csv(ruta)

### EXPLORACION DE DATOS

In [86]:
df.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
1,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13 km/kg,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
2,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50

In [87]:
df.tail()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
5842,6014,Maruti Swift VDI,Delhi,2014,27365,Diesel,Manual,First,28.4 kmpl,1248 CC,74 bhp,5.0,7.88 Lakh,4.75
5843,6015,Hyundai Xcent 1.1 CRDi S,Jaipur,2015,100000,Diesel,Manual,First,24.4 kmpl,1120 CC,71 bhp,5.0,NaN,4.00
5844,6016,Mahindra Xylo D4 BSIV,Jaipur,2012,55000,Diesel,Manual,Second,14.0 kmpl,2498 CC,112 bhp,8.0,NaN,2.90
5845,6017,Maruti Wagon R VXI,Kolkata,2013,46000,Petrol,Manual,First,18.9 kmpl,998 CC,67.1 bhp,5.0,NaN,2.65
5846,6018,Chevrolet Beat Diesel,Hyderabad,2011,47000,Diesel,Manual,First,25.44 kmpl,936 CC,57.6 bhp,5.0,NaN,2.50

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5847 non-null   int64
 1   Name               5847 non-null   object
 2   Location           5847 non-null   object
 3   Year               5847 non-null   int64
 4   Kilometers_Driven  5847 non-null   int64
 5   Fuel_Type          5847 non-null   object
 6   Transmission       5847 non-null   object
 7   Owner_Type         5847 non-null   object
 8   Mileage            5845 non-null   object
 9   Engine             5811 non-null   object
 10  Power              5811 non-null   object
 11  Seats              5809 non-null   float64
 12  New_Price          815 non-null    object
 13  Price              5847 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 639.6+ KB

In [89]:
df.describe(include='all')

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
count,5847.000000,5847,5847,5847.000000,5.847000e+03,5847,5847,5847,5845,5811,5811,5809.000000,815,5847.000000
unique,NaN,1804,11,NaN,NaN,3,2,4,419,140,361,NaN,534,NaN
top,NaN,Mahindra XUV500 W8 2WD,Mumbai,NaN,NaN,Diesel,Manual,First,18.9 kmpl,1197 CC,74 bhp,NaN,95.13 Lakh,NaN
freq,NaN,49,762,NaN,NaN,3161,4135,4811,172,602,235,NaN,6,NaN
mean,3013.181461,NaN,NaN,2013.448435,5.841013e+04,NaN,NaN,NaN,NaN,NaN,NaN,5.286452,NaN,9.653742
std,1736.398890,NaN,NaN,3.194949,9.237971e+04,NaN,NaN,NaN,NaN,NaN,NaN,0.806668,NaN,11.275966
min,1.000000,NaN,NaN,1998.000000,1.710000e+02,NaN,NaN,NaN,NaN,NaN,NaN,2.000000,NaN,0.440000
25%,1509.500000,NaN,NaN,2012.000000,3.346750e+04,NaN,NaN,NaN,NaN,NaN,NaN,5.000000,NaN,3.550000
50%,3015.000000,NaN,NaN,2014.000000,5.257600e+04,NaN,NaN,NaN,NaN,NaN,NaN,5.000000,NaN,5.750000
75%,4517.500000,NaN,NaN,2016.000000,7.249050e+04,NaN,NaN,NaN,NaN,NaN,NaN,5.000000,NaN,10.250000
max,6018.000000,NaN,NaN,2019.000000,6.500000e+06,NaN,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,160.000000

In [90]:
df.isna().sum()

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [91]:
data_report(df=df)

COL_N,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
DATA_TYPE,int64,object,object,int64,int64,object,object,object,object,object,object,float64,object,float64
MISSINGS (%),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.03,0.62,0.62,0.65,86.06,0.0
UNIQUE_VALUES,5847,1804,11,22,3019,3,2,4,419,140,361,8,534,1366
CARDIN (%),100.0,30.85,0.19,0.38,51.63,0.05,0.03,0.07,7.17,2.39,6.17,0.14,9.13,23.36

Evidenciamos por medio del anterior cuadro que la cardinalidad de la colomna 'Unnamed: 0' es del 100%, lo que nos da via libre para eliminarla.

In [92]:
#Eliminamos variable con cardinalidad 100%

df = df.drop(columns='Unnamed: 0', axis=1)

Verificamos la cantidad de NaNs que tiene cada una de las variables

In [93]:
df.isna().sum()/len(df)*100

Name                  0.000000
Location              0.000000
Year                  0.000000
Kilometers_Driven     0.000000
Fuel_Type             0.000000
Transmission          0.000000
Owner_Type            0.000000
Mileage               0.034206
Engine                0.615700
Power                 0.615700
Seats                 0.649906
New_Price            86.061228
Price                 0.000000
dtype: float64

### EDA

In [94]:
df.duplicated().sum()

0

### Tratamiento de NaNs en las variables

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               5847 non-null   object
 1   Location           5847 non-null   object
 2   Year               5847 non-null   int64
 3   Kilometers_Driven  5847 non-null   int64
 4   Fuel_Type          5847 non-null   object
 5   Transmission       5847 non-null   object
 6   Owner_Type         5847 non-null   object
 7   Mileage            5845 non-null   object
 8   Engine             5811 non-null   object
 9   Power              5811 non-null   object
 10  Seats              5809 non-null   float64
 11  New_Price          815 non-null    object
 12  Price              5847 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 594.0+ KB

In [96]:
# Variable 'New_Price'
#Esta variable como es la que vamos a predecir, vamos a imputar sus NaNs con ceros

df['New_Price'].fillna(0, inplace=True)

In [97]:
# Variables 'Mileage', 'Engine', 'Power' y 'Seats' cada una con menos del 1% de NaNs, por lo que procederemos a elimiar estas filas

df = df.dropna()

In [98]:
# Evaluamos la funcion info para verificar la no presencia de nulos y ver cuantas filas contiene el dataset despues de las imputaciones
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5807 entries, 0 to 5846
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               5807 non-null   object
 1   Location           5807 non-null   object
 2   Year               5807 non-null   int64
 3   Kilometers_Driven  5807 non-null   int64
 4   Fuel_Type          5807 non-null   object
 5   Transmission       5807 non-null   object
 6   Owner_Type         5807 non-null   object
 7   Mileage            5807 non-null   object
 8   Engine             5807 non-null   object
 9   Power              5807 non-null   object
 10  Seats              5807 non-null   float64
 11  New_Price          5807 non-null   object
 12  Price              5807 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 635.1+ KB

### Tratamos el tipo de variables, intentaremos volver las variables categoricas a numericas

Definimos porgrupoes las variables entre Categoricas y Numericas

In [99]:
var_categoricas =['Name', 'Location', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'New_Price']
var_numericas = ['Year', 'Kilometers_Driven', 'Seats', 'price']

In [100]:
mileage_units = verificador_unidades(df['Mileage'])
print(f'Unidades Mileage: {mileage_units}')

engine_units = verificador_unidades(df['Engine'])
print(f'Unidades Engine: {engine_units}')

power_units = verificador_unidades(df['Power'])
print(f'Unidades Power: {power_units}')

Unidades Mileage: {'km/kg', 'kmpl'}
Unidades Engine: {'CC'}
Unidades Power: {'bhp'}

### Variable 'Mileage'

La conversión de kilómetros por litro (kmpl) a kilómetros por kilogramo (km/kg) implica considerar la densidad del combustible. La relación entre estas dos unidades depende del tipo específico de combustible utilizado, ya que la densidad del combustible afecta la cantidad de masa (en kilogramos) en un volumen dado (en litros).

La fórmula general para la conversión de kmpl a km/kg es la siguiente:

$ km/kg = kmpl/densidad del combustible en kg/L $

​La densidad del diésel y de la gasolina (a menudo referida como "petróleo" en algunos lugares) puede variar, si usamos estimaciones generales:

Densidad del Diésel: La densidad del diésel varía, pero suele estar en el rango de 0.82 a 0.86 kg/L. Promedio = 0.84 kg/L
Densidad de la Gasolina (Petróleo):

La densidad de la gasolina también varía, pero típicamente se encuentra en el rango de 0.72 a 0.78 kg/L. Promedio = 0.75 kg/L

In [101]:
condicion = (df['Mileage'].str.contains('km/kg')) #Requerimos las filas que contengan la unidad de medida km/kg de la variable 'Mileage'

# Promedio de las densidades de cada uno de los combustibles propuestos en el dataset
densidad_Petrol = 0.75
densidad_diesel = 0.84


for index, row in df[condicion].iterrows():
    try:
        
        mileage_valor = float(row['Mileage'].replace(' km/kg', ''))

        # Obtener la densidad correspondiente al tipo de combustible
        if row['Fuel_Type'] == 'Diesel':
            conversion = mileage_valor * densidad_diesel
        elif row['Fuel_Type'] == 'Petrol':
            conversion = mileage_valor * densidad_Petrol
        else:
            # Manejar el caso en el que el tipo de combustible no sea Diesel ni Petrol
            conversion = mileage_valor

        # Actualizar el valor en el DataFrame
        df.at[index, 'Mileage'] = conversion

    except ValueError:
        # Manejar errores si el formato de 'Mileage' no es el esperado
        print(f"Error en la fila {index}: No se pudo convertir 'Mileage'")

In [102]:
for index, row in df.iterrows():
    if type(row['Mileage']) == str and ' kmpl' in row['Mileage']:
        
        df.at[index, 'Mileage'] = row['Mileage'].replace(' kmpl', '')

df['Mileage'] = df['Mileage'].astype(float)
#df.head()

### Variables 'Engine' y 'Power'

Como las variables 'Engine' y 'Power' tienen una unica unidad, procedemos a eliminarla y a convertir el valor de cada celda a tipo numerico

In [103]:
#Unidades Engine: {'CC'}
#Unidades Power: {'bhp'}

df['Engine'] = df['Engine'].str.replace(' CC', '').astype(float)
df['Power'] = df['Power'].str.replace(' bhp', '').astype(float)

### Variable 'New_Price'

Para convertir de "Lakh" a "Crore" en el sistema numérico indio, recordar que:

- 1 Lakh = 100,000 
- 1 Crore = 10,000,000.

Entonces, para convertir de Lakh a Crore, simplemente divides la cantidad en Lakh por 100:

- $ Cantidad en Crore = Cantidad en Lakh / 100 $

- $ Cantidad en Lakh = Cantidad en Crore * 100 $

In [104]:
# Definimos una funcion que nos convierta de acuerdo a lo especificado arriba, los valores del precio del vehiculo nuevo

def convertir_valor_cp(valor):
    if isinstance(valor, str):
        if 'Lakh' in valor:
            return float(valor.replace(' Lakh', ''))
        elif 'Cr' in valor:
            return float(valor.replace(' Cr', '')) * 100
    return valor

# Aplicar la función de conversión a la columna 'CP'
df['New_Price'] = df['New_Price'].apply(convertir_valor_cp)

# Convertir la columna 'CP' al tipo de datos float
df['New_Price'] = df['New_Price'].astype(float)

### Variable 'Owner_Type'

Reemplazaremos los valores de cada una de sus cuatro categorias por valores numericos del 0 al 3.

In [105]:
df['Owner_Type'].unique()

array(['First', 'Second', 'Fourth & Above', 'Third'], dtype=object)

In [106]:
mapeo_owner_type = {'First': 3, 'Second': 2, 'Third': 1, 'Fourth & Above': 0}

# Aplicar el mapeo a la columna 'Owner_Type'
df['Owner_Type'] = df['Owner_Type'].map(mapeo_owner_type)

### Variable 'Year'

Podemos trabajar este dato de manera diferente, en lugar de tener un año, podriamos tener una edad a tiempo presente. Asi que podemos implementar una nueva columna que nos muestre la edad del vehiculo al año 2024.

In [107]:
# Asignamos a la variable año_actual el año en que se este realizando la prediccion 
año_actual = 2024
df['Edad'] = año_actual - df['Year']

In [108]:
df.drop('Year', axis = 1, inplace = True)

In [109]:
df

,Name,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Edad
0,Hyundai Creta 1.6 CRDi SX Option,Pune,41000,Diesel,Manual,3,19.67,1582.0,126.20,5.0,0.00,12.50,9
1,Honda Jazz V,Chennai,46000,Petrol,Manual,3,9.75,1199.0,88.70,5.0,8.61,4.50,13
2,Maruti Ertiga VDI,Chennai,87000,Diesel,Manual,3,20.77,1248.0,88.76,7.0,0.00,6.00,12
3,Audi A4 New 2.0 TDI Multitronic,Coimbatore,40670,Diesel,Automatic,2,15.20,1968.0,140.80,5.0,0.00,17.74,11
4,Nissan Micra Diesel XV,Jaipur,86999,Diesel,Manual,3,23.08,1461.0,63.10,5.0,0.00,3.50,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5842,Maruti Swift VDI,Delhi,27365,Diesel,Manual,3,28.40,1248.0,74.00,5.0,7.88,4.75,10
5843,Hyundai Xcent 1.1 CRDi S,Jaipur,100000,Diesel,Manual,3,24.40,1120.0,71.00,5.0,0.00,4.00,9
5844,Mahindra Xylo D4 BSIV,Jaipur,55000,Diesel,Manual,2,14.00,2498.0,112.00,8.0,0.00,2.90,12
5845,Maruti Wagon R VXI,Kolkata,46000,Petrol,Manual,3,18.90,998.0,67.10,5.0,0.00,2.65,11
5846,Chevrolet Beat Diesel,Hyderabad,47000,Diesel,Manual,3,25.44,936.0,57.60,5.0,0.00,2.50,13

# GUARDAMOS DATOS PROCESADOS EN ARCHIVOS

Teniendo como referencia la varianble que intentaremos predecir 'New_Price', haremos la division del dataset en dos, una parte de este, donde el valor de la variable es cero lo guardaremos como dataset para hacer el test y en donde la variable toma un valor diferente a cero, lo usaremos para hacer el train.

In [111]:
# Dataset con datos de variable objetivo con valores diferentes a cero
df_train = df[df['New_Price'] != 0]
df_train = df_train.reset_index(drop = True)


# Dataset con datos de variable objetivo con valores iguales a cero
df_test = df[df['New_Price'] == 0]
df_test.drop('New_Price', axis=1, inplace=True)
df_test = df_test.reset_index(drop = True)

In [112]:
df_train.to_csv('../data/processed/train.csv', index=False) #Datos que seran utilizados como train
df_test.to_csv('../data/processed/test.csv', index=False) #Datos que seran utilizados como test

In [113]:
df_test

,Name,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Edad
0,Hyundai Creta 1.6 CRDi SX Option,Pune,41000,Diesel,Manual,3,19.67,1582.0,126.20,5.0,12.50,9
1,Maruti Ertiga VDI,Chennai,87000,Diesel,Manual,3,20.77,1248.0,88.76,7.0,6.00,12
2,Audi A4 New 2.0 TDI Multitronic,Coimbatore,40670,Diesel,Automatic,2,15.20,1968.0,140.80,5.0,17.74,11
3,Nissan Micra Diesel XV,Jaipur,86999,Diesel,Manual,3,23.08,1461.0,63.10,5.0,3.50,11
4,Volkswagen Vento Diesel Comfortline,Pune,64430,Diesel,Manual,3,20.54,1598.0,103.60,5.0,5.20,11
...,...,...,...,...,...,...,...,...,...,...,...,...
4988,Honda Amaze VX i-DTEC,Coimbatore,70602,Diesel,Manual,3,25.80,1498.0,98.60,5.0,4.83,9
4989,Hyundai Xcent 1.1 CRDi S,Jaipur,100000,Diesel,Manual,3,24.40,1120.0,71.00,5.0,4.00,9
4990,Mahindra Xylo D4 BSIV,Jaipur,55000,Diesel,Manual,2,14.00,2498.0,112.00,8.0,2.90,12
4991,Maruti Wagon R VXI,Kolkata,46000,Petrol,Manual,3,18.90,998.0,67.10,5.0,2.65,11
4992,Chevrolet Beat Diesel,Hyderabad,47000,Diesel,Manual,3,25.44,936.0,57.60,5.0,2.50,13

In [114]:
df_train

,Name,Location,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Edad
0,Honda Jazz V,Chennai,46000,Petrol,Manual,3,9.75,1199.0,88.70,5.0,8.61,4.50,13
1,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,36000,Diesel,Automatic,3,11.36,2755.0,171.50,8.0,21.00,17.50,8
2,Maruti Ciaz Zeta,Kochi,25692,Petrol,Manual,3,21.56,1462.0,103.25,5.0,10.65,9.95,6
3,Mitsubishi Pajero Sport 4X4,Delhi,110000,Diesel,Manual,3,13.50,2477.0,175.56,7.0,32.01,15.00,10
4,BMW 3 Series 320d,Kochi,32982,Diesel,Automatic,3,22.69,1995.0,190.00,5.0,47.87,18.55,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...
809,Tata Bolt Revotron XT,Chennai,10000,Petrol,Manual,3,17.57,1193.0,88.70,5.0,7.77,4.00,8
810,Volkswagen Vento 1.6 Highline,Mumbai,38000,Petrol,Manual,3,16.09,1598.0,103.50,5.0,11.91,3.25,13
811,Maruti Vitara Brezza VDi,Pune,37208,Diesel,Manual,3,24.30,1248.0,88.50,5.0,9.93,7.43,8
812,Honda Brio 1.2 VX MT,Delhi,33746,Petrol,Manual,3,18.50,1198.0,86.80,5.0,6.63,3.20,11
813,Maruti Swift VDI,Delhi,27365,Diesel,Manual,3,28.40,1248.0,74.00,5.0,7.88,4.75,10

### Variables 'Name', 'Location', 'Fuel_Type', 'Transmission'

De momento nos vamos a arriesgar a realizar un LabelEncoder a la variable 'Name' y OHE a las variables 'Location', 'Fuel_Type', 'Transmission'. Una vez evaluados los modelos y viendo la importancia de las variables en la prediccion, tomaremos decisiones sobre estas.

In [27]:
#Clasificacion de variables para su respectivo tratamiento

le = LabelEncoder()
df['Name']=le.fit_transform(df['Name'])

In [31]:
variables_cat = ['Location', 'Fuel_Type', 'Transmission']

df_numerico = apply_onehot_encoder(df, variables_cat)